# Sakila Star Schema & ETL

# SETUP Using ipython-sql

- load ipython-sql: `%load_ext sql`

- To execute SQL queries you write one of the following atop of your cell: 
    - `%sql`
        - For a one-liner SQL query
        - You can access a python var using `$`    
    - `%%sql`
        - For a multi-line SQL query
        - You can **NOT** access a python var using `$`

- Adding `"!"` at the beginning of a jupyter cell runs a command in a shell, i.e. we are not running python code but we are running the commmand-line utilities

In [23]:
#unhash if not installed program before
!pip install ipython-sql
#%pip install PyMySQL

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in c:\users\owner\appdata\roaming\python\python39\site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\owner\appdata\roaming\python\python39\site-packages (from ipython-sql) (2.0.11)
Requirement already satisfied: ipython in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: ipython-genutils in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\users\owner\appdata\roaming\python\python39\site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlparse in c:\users\owner\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.3.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: decorator in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pygments in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: backcall in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)

# STEP1 : Connect to the local database where Sakila is loaded (MySQL)

In [24]:
import pymysql
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [25]:
DB_ENDPOINT= 'localhost'
DB = 'sakila'
DB_USER= 'root'
DB_PASSWORD = 'Fun613613!' #TO BE REPLACED WITH PERSONAL PASSWORD
DB_PORT = '3306'

# mysql+pymysql://username:password@host:port/database
conn_string="mysql+pymysql://{}:{}@{}/{}" \
                    .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB)
# print(conn_string)

In [26]:
%sql $conn_string

# STEP2 : Explore the  3NF Schema

## 2.1 How much? What data sizes are we looking at?

In [9]:
%sql select count(*) from rental;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(16044,)]

## 2.2 When? What time period are we talking about?

In [11]:
%sql select min(last_update),max(last_update) from payment;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(datetime.datetime(2006, 2, 15, 22, 12, 30), datetime.datetime(2006, 2, 15, 22, 24, 13))]

In [25]:
%sql select min(release_year),max(release_year) from film;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(2006, 2006)]

## 2.3 Where? Where do events in this database occur? Are they proportional? (10 rows)

In [32]:
%sql select distinct(district), count(district) from address group by district limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('Alberta', 2),
 ('QLD', 2),
 ('Nagasaki', 1),
 ('California', 9),
 ('Attika', 1),
 ('Mandalay', 1),
 ('Nantou', 2),
 ('Texas', 5),
 ('Central Serbia', 1),
 ('Hamilton', 1)]

# STEP3: Perform some simple data analysis

## 3.1 Insight 1:   Top Grossing Movies 
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

### 3.1.1 Films

In [34]:
##COMPLETE CODE to sample film table (5 rows)
%sql select * from film limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 1, None, 3, Decimal('4.99'), 48, Decimal('12.99'), 'G', 'Trailers,Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 1, None, 7, Decimal('2.99'), 50, Decimal('18.99'), 'NC-17', 'Trailers,Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 1, None, 5, Decimal('2.99'), 117, Decimal('26.99'), 'G', 'Commentaries,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 1, None, 6, Decimal('2.99'), 130, Decimal('22.99'), 'G', 'Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

### 3.1.2 Payments

In [38]:
##COMPLETE CODE to sample payment table (5 rows)
%sql select * from payment limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 1, 1, 76, Decimal('2.99'), datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (2, 1, 1, 573, Decimal('0.99'), datetime.datetime(2005, 5, 28, 10, 35, 23), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (3, 1, 1, 1185, Decimal('5.99'), datetime.datetime(2005, 6, 15, 0, 54, 12), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (4, 1, 2, 1422, Decimal('0.99'), datetime.datetime(2005, 6, 15, 18, 2, 53), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (5, 1, 2, 1476, Decimal('9.99'), datetime.datetime(2005, 6, 15, 21, 8, 46), datetime.datetime(2006, 2, 15, 22, 12, 30))]

### 3.1.3 Inventory

In [39]:
##COMPLETE CODE to sample inventory table (5 rows)
%sql select * from inventory limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 5, 9, 17))]

### 3.1.4 Get the movie of every payment with payment date and the customer reference (5 rows)

In [21]:
%%sql select p.payment_date, f.title, p.customer_id from payment p 
join rental r on r.rental_id = p.rental_id 
join inventory i on i.inventory_id = r.inventory_id 
join film f on f.film_id = i.film_id limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(datetime.datetime(2005, 7, 8, 19, 3, 15), 'ACADEMY DINOSAUR', 431),
 (datetime.datetime(2005, 8, 2, 20, 13, 10), 'ACADEMY DINOSAUR', 518),
 (datetime.datetime(2005, 8, 21, 21, 27, 43), 'ACADEMY DINOSAUR', 279),
 (datetime.datetime(2005, 5, 30, 20, 21, 7), 'ACADEMY DINOSAUR', 411),
 (datetime.datetime(2005, 6, 17, 20, 24), 'ACADEMY DINOSAUR', 170)]

### 3.1.5 sum movie rental revenue (top 10)

In [18]:
##COMPLETE CODE
%sql select sum(amount) from payment limit 10;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(Decimal('67406.56'),)]

## 3.2 Insight 2:   Top grossing cities 
- Payments amounts are in table `payment`
- Cities are in table `cities`
- `payment` &rarr; `customer` &rarr; `address` &rarr; `city`

### 3.2.1 Get the city of each payment with customer & rental references (10 rows)

In [ ]:
%%sql SELECT p.payment_id, ct.city, c.customer_id, 
r.rental_id FROM payment p 
JOIN customer c ON p.customer_id = c.customer_id 
JOIN rental r ON r.customer_id = c.customer_id 
JOIN address a ON a.address_id=c.address_id 
JOIN city ct ON ct.city_id = a.city_id LIMIT 10;

### 3.2.2 Top grossing cities (10 rows)

In [ ]:
%%sql SELECT ct.city, SUM(p.amount) amount 
FROM payment p 
JOIN customer c ON p.customer_id = c.customer_id 
JOIN address a ON a.address_id=c.address_id 
JOIN city ct ON ct.city_id = a.city_id 
GROUP BY ct.city 
ORDER BY amount DESC LIMIT 10;

## 3.3 Insight 3 : Revenue of a movie by customer city and by month

In [ ]:
### 3.3.1 Total revenue by month (10 rows)
##sql EXTRACT() gets a datepart from date column

In [20]:
%%sql EXTRACT(MONTH from payment_date) month, SUM(amount) revenue
From payment
Group py month LIMIT 10;

 * mysql+pymysql://root:***@localhost/sakila
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'EXTRACT(month from payment_date)' at line 1")
[SQL: EXTRACT(month from payment_date)]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
##COMPLETE CODE

### 3.3.2 FOR each rental give me the amount, the customer the city the month.  (10 rows)

In [ ]:
%%sql select r.rental.id, p.amount, c.customer_id, ci.city, EXTRACT(month from payment_date)
from sakila.payment p 
join 
on 
join address a
on c.address.id = a.address_id
join sakila.customer c 
on c.customer_id = ad.customer_id
join sakila.address ad
on a.address_id = c.address_id
join sakila.city 
on c.city_id =a.city_id

%%sql select p.payment_date, f.title, p.customer_id from payment p 
join rental r on r.rental_id = p.rental_id 
join inventory i on i.inventory_id = r.inventory_id 
join film f on f.film_id = i.film_id limit 5

In [ ]:
##COMPLETE CODE

### 3.3.3 FINAL ANALYSIS: Sum of revenue of each movie by city and by month (10 rows)

In [ ]:
%%sql
select f.title_date, SUM(p.amount), MAX(ci.city) city, MAX(EXTRACT(MONTH from p.payment_date))month
group by f.title
from payment p


# to city

# STEP4 : Creating Facts & Dimensions Tables as Star diagram

 * mysql+pymysql://root:***@localhost/sakila
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'CREATE DATABASE IF NOT EXISTS star)' at line 1")
[SQL: (CREATE DATABASE IF NOT EXISTS star);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [30]:
%%sql CREATE TABLE IF NOT EXISTS dimmovie(movie_key MEDIUMINT UNSIGNED Primary Key AUTO_INCREMENT, 
film_id MEDIUMINT UNSIGNED NOT NULL,
title NVARCHAR(300)  NULL,
description NVARCHAR(2000)  NULL,
release_year year(4)  NULL,
languages NVARCHAR(255)  NULL,
original_language NVARCHAR(255)  NULL,
rental_duration MEDIUMINT ,
length MEDIUMINT ,
rating NVARCHAR(50) ,
special_features NVARCHAR(100)  NULL);

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [37]:
%%sql CREATE TABLE IF NOT EXISTS dimdate(date_key MEDIUMINT UNSIGNED 
Primary Key AUTO_INCREMENT, 
date DATE,
year MEDIUMINT,
quarter TINYINT,
month TINYINT(12) ,
day TINYINT ,
week TINYINT  ,
is_weekend boolean);

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [32]:
%%sql CREATE TABLE IF NOT EXISTS dimstore(store_key MEDIUMINT UNSIGNED Primary Key AUTO_INCREMENT, 
store_id MEDIUMINT UNSIGNED NOT NULL,
address NVARCHAR(100),
description NVARCHAR(255)  ,
address_2 NVARCHAR(100) ,
city NVARCHAR(255)  ,
country NVARCHAR(255) ,
postal_code TINYINT,
manager_first_name TINYINT ,
manager_last_name NVARCHAR(50) ,
start_date timestamp, 
end_date timestamp);

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [66]:
%%sql CREATE TABLE IF NOT EXISTS dimcustomer(customer_key MEDIUMINT  AUTO_INCREMENT,
customer_id SMALLINT NOT NULL, 
first_name VARCHAR(200),
last_name VARCHAR(200),
email VARCHAR(200),
address VARCHAR(200),
address2 VARCHAR(500),
district VARCHAR(200),
city VARCHAR(200),
country VARCHAR(200),
postal_code VARCHAR(100),
phone VARCHAR(200),
active TINYINT UNSIGNED,
create_date DATE,
start_date DATE,
end_date DATE,
PRIMARY KEY(customer_key));

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [68]:
%%sql CREATE TABLE IF NOT EXISTS factsales
(sales_key MEDIUMINT UNSIGNED PRIMARY KEY AUTO_INCREMENT,
date_key MEDIUMINT UNSIGNED,
customer_key SMALLINT ,
movie_key MEDIUMINT UNSIGNED,
store_key MEDIUMINT UNSIGNED,
sales_amount MEDIUMINT UNSIGNED,
CONSTRAINT pk_sales PRIMARY KEY(sales_key),
CONSTRAINT fk_date FOREIGN KEY (date_key) REFERENCES dimdate(date_key),
CONSTRAINT fk_customer FOREIGN KEY (customer_key) REFERENCES dimcustomer(customer_key),
CONSTRAINT fk_movie FOREIGN KEY (movie_key) REFERENCES dimmovie(movie_key),
CONSTRAINT fk_store FOREIGN KEY (store_key) REFERENCES dimstore(store_key)
);

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [ ]:
# STEP 5: Pipe the data from 3NF tables to Facts & Dimension Tables

In [71]:
%%sql INSERT INTO dimdate (date, year, quarter,
month, day, week, is_weekend)
SELECT
rental_date as date,
YEAR(rental_date) as year,
QUARTER(rental_date) as quarter,
MONTH(rental_date) as month,
DAY(rental_date) as day,
WEEK(rental_date) as week,
CASE WHEN DAYOFWEEK(rental_date) IN (6,7) THEN 1 ELSE 0 END as is_weekend
FROM sakila.rental;

 * mysql+pymysql://root:***@localhost/sakila
16044 rows affected.

[]

In [ ]:
%%sql INSERT INTO dimstore
(
 store_id,
 address,
 address2,
 district,
 city,
 country,
 postal_code,
 manager_first_name,
 manager_last_name,
 start_date,
 end_date)

In [109]:
%%sql
SELECT
 store_id,
 a.address,
 a.address_2,
 a.district,
 ci.city,
 co.country,
 a.postal_code,
 st.first_name AS manager_first_name,
 st.last_name AS manager_last_name,
#  start_date,
#  end_date
FROM customer c
JOIN address a
ON a.address_id=c.address_id
JOIN city ci
ON ci.city_id=a.city_id
JOIN country co
ON co.country_id=ci.country_id
JOIN rental r
ON c.customer_id=r.customer_id
FROM sakila.store;

 * mysql+pymysql://root:***@localhost/sakila
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM customer c\nJOIN address a\nON a.address_id=c.address_id\nJOIN city ci\nON ci.c' at line 13")
[SQL: SELECT
 store_id,
 a.address,
 a.address_2,
 a.district,
 ci.city,
 co.country,
 a.postal_code,
 st.first_name AS manager_first_name,
 st.last_name AS manager_last_name,
#  start_date,
#  end_date
FROM customer c
JOIN address a
ON a.address_id=c.address_id
JOIN city ci
ON ci.city_id=a.city_id
JOIN country co
ON co.country_id=ci.country_id
JOIN rental r
ON c.customer_id=r.customer_id
FROM sakila.store;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
%%sql INSERT INTO dimcustomer
(
 customer_id,
 first_name,
 last_name,
 email,
 address,
 address2,
 district,
 city,
 country,
 postal_code,
 phone,
 active,
 create_date ,
 start_date,
 end_date)SELECT
c.customer_id,
c.first_name,
c.last_name,
c.email,
a.address,
a.address2,
a.district,
ci.city,
co.country,
A.postal_code,
a.phone,
c.active,
c.create_date,
r.rental_date AS start_date,
c.last_update AS end_date
FROM customer c
JOIN address a
ON a.address_id=c.address_id
JOIN city ci
ON ci.city_id=a.city_id
JOIN country co
ON co.country_id=ci.country_id
JOIN rental r
ON c.customer_id=r.customer_id

In [93]:
%sql ALTER TABLE dimmovie MODIFY length SMALLINT;

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [94]:

%%sql 
INSERT INTO dimmovie (film_id, title, description, release_year,
languages, original_language, rental_duration, length, rating, special_features)
SELECT
film_id,
title,
description ,
release_year,
language_id as languages,
original_language_id as original_language,
rental_duration,
length,
rental_rate as rating,
special_features
FROM sakila.film;

 * mysql+pymysql://root:***@localhost/sakila
1000 rows affected.

[]

In [ ]:
%%sql CREATE TABLE IF NOT EXISTS dimmovie(movie_key MEDIUMINT UNSIGNED Primary Key AUTO_INCREMENT, 
film_id MEDIUMINT UNSIGNED NOT NULL,
title NVARCHAR(50) NOT NULL,
description NVARCHAR(255)  NULL,
release_year year(4) NOT NULL,
languages NVARCHAR(255) NOT NULL,
original_language NVARCHAR(255)  NULL,
rental_duration TINYINT NOT NULL,
length TINYINT NOT NULL,
rating NVARCHAR(50) NOT NULL,
special_features NVARCHAR(100)

In [ ]:
%%sql INSERT INTO factsales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT d.date_key, dc.customer_key, dm.movie_key, ds.store_key, p.amount
FROM rental r
LEFT JOIN dimcustomer dc
ON r.customer_id= dc.customer_id
LEFT JOIN payment p
ON r.rental_id= p.rental_id
LEFT JOIN inventory i
ON r.inventory_id= i.inventory_id
LEFT JOIN dimmovie dm
ON i.film_id= dm.film_id
LEFT JOIN customer cu
ON r.customer_id= cu.customer_id
LEFT JOIN dimstore ds
ON cu.store_id= ds.store_id
LEFT JOIN dimdate d
ON DATE(r.rental_date)= d.date;

In [ ]:
##COMPLETE CODE

# STEP 6: Repeat the final computation (Each movie and sum of amount, by customer, city and by month) from the facts & dimension table

## 6.1 Facts Table has all the needed dimensions, no need for deep joins
Sample of facts table (5 rows)

In [ ]:
%%time
##COMPLETE CODE
%sql SELECT * FROM factsales LIMIT 5

## 6.2 Join fact table with dimensions tables to replace 'keys' with necessary attributes
Code for timing given - to time sample process!

In [ ]:
%%time
##COMPLETE CODE

## 6.3 With fact & dimensions tables compute the final analysis (Sum of revenue of each movie by city and by month)
Code for timing given - to time full process!

In [ ]:
%%time
##COMPLETE CODE
SELECT m.film_id, sum(fs.sales_amount) sum_sales_amount, s.city, MIN(EXTRACT(month from d.date )) month
FROM factsales fs
JOIN dimdate d ON d.date_key = fs.date_key
JOIN dimmovie m ON m.movie_id = fs.movie_id
JOIN dimstore s ON s.store_id = fs.store_id
Group by m.film_id, s.city_id
LIMIT 20;

## 6.4 With Original database designed tables compute the final analysis (Sum of revenue of each movie by city and by month)
Code for timing given - to time full process!
Use code in above cell without the limitation on output rows

In [ ]:
%%time
##COMPLETE CODE
SELECT f.film_id, sum(p.amount) sum_sales, ct.city, MIN(EXTRACT(month from p.payment_date )) month
JOIN rental r on p.rental_id = r.rental_id
JOIN inventory i on p.inventory_id = i.inventory_id
JOIN film f on p.film_id = f.film_id
join customer c on c.customer_id = c.customer_id
join address a on c.address_id = a.address_id
join city ct on c.city_id = ct.city_id
Group by f.film_id, ct.city_id

# Conclusion

Write 2 lines of your findings

In [ ]:
#The star scheme timing is much faster and takes up less space than that of the ERD Scheme.